In [1]:
import os
import pandas as pd
import numpy as np

#df = pd.read_excel('narrative_raw.xlsx')
df = pd.read_csv('raw.csv',index_col = False, dtype = {"CountyCode": str,"DistrictCode": str,"SchoolCode": str})
df.head(2)

,CountyCode,CountyName,DistrictCode,DistrictName,SchoolCode,SchoolName,TeacherCount_School,TeacherCount_State,TeacherAvgYearsExp_School,TeacherAvgYearsExp_State,TeacherAvgYearsExpInDistrict_School,TeacherAvgYearsExpInDistrict_State,TeacherInDistrict4YearsOrMore_School,TeacherInDistrict4YearsOrMore_State
0,01,ATLANTIC,0010,ABSECON CITY,050,EMMA C ATTALES,29,117464,13.6,12.0,12.9,10.7,92.9,75.5
1,01,ATLANTIC,0010,ABSECON CITY,060,H ASHTON MARSH,35,117464,16.1,12.0,15.6,10.7,94.1,75.5

### Check number of columns and rows

In [2]:
df.shape

(2519, 14)

### Adding columns from 2016-17 table

In [4]:
df['Year'] = '2017-18'

### Check if columns are added properly

In [5]:
df.head(2)

,CountyCode,CountyName,DistrictCode,DistrictName,SchoolCode,SchoolName,TeacherCount_School,TeacherCount_State,TeacherAvgYearsExp_School,TeacherAvgYearsExp_State,TeacherAvgYearsExpInDistrict_School,TeacherAvgYearsExpInDistrict_State,TeacherInDistrict4YearsOrMore_School,TeacherInDistrict4YearsOrMore_State,Year
0,01,ATLANTIC,0010,ABSECON CITY,050,EMMA C ATTALES,29,117464,13.6,12.0,12.9,10.7,92.9,75.5,2017-18
1,01,ATLANTIC,0010,ABSECON CITY,060,H ASHTON MARSH,35,117464,16.1,12.0,15.6,10.7,94.1,75.5,2017-18

### Check missing values

In [6]:
df.isnull().sum()

CountyCode                              0
CountyName                              0
DistrictCode                            0
DistrictName                            0
SchoolCode                              0
SchoolName                              0
TeacherCount_School                     0
TeacherCount_State                      0
TeacherAvgYearsExp_School               0
TeacherAvgYearsExp_State                0
TeacherAvgYearsExpInDistrict_School     0
TeacherAvgYearsExpInDistrict_State      0
TeacherInDistrict4YearsOrMore_School    0
TeacherInDistrict4YearsOrMore_State     0
Year                                    0
dtype: int64

### Fill missing values

In [7]:
#df = df.fillna('NA')

### Check again if missing values are dealt properly

In [8]:
#df.isnull().sum()

### Check for meaningless values such as '**','N'

In [7]:
df['TeacherCount_School'] = df['TeacherCount_School'].replace('N','9999999')
df['TeacherCount_State'] = df['TeacherCount_State'].replace('N','9999999')
df['TeacherAvgYearsExp_School'] = df['TeacherAvgYearsExp_School'].replace('N','9999999')
df['TeacherAvgYearsExp_State'] = df['TeacherAvgYearsExp_State'].replace('N','9999999')
df['TeacherAvgYearsExpInDistrict_School'] = df['TeacherAvgYearsExpInDistrict_School'].replace('N','9999999')
df['TeacherAvgYearsExpInDistrict_State'] = df['TeacherAvgYearsExpInDistrict_State'].replace('N','9999999')
df['TeacherInDistrict4YearsOrMore_School'] = df['TeacherInDistrict4YearsOrMore_School'].replace('N','9999999')
df['TeacherInDistrict4YearsOrMore_State'] = df['TeacherInDistrict4YearsOrMore_State'].replace('N','9999999')

### Check Data types of all columns

In [8]:
df.dtypes

CountyCode                               object
CountyName                               object
DistrictCode                             object
DistrictName                             object
SchoolCode                               object
SchoolName                               object
TeacherCount_School                      object
TeacherCount_State                        int64
TeacherAvgYearsExp_School                object
TeacherAvgYearsExp_State                float64
TeacherAvgYearsExpInDistrict_School      object
TeacherAvgYearsExpInDistrict_State      float64
TeacherInDistrict4YearsOrMore_School     object
TeacherInDistrict4YearsOrMore_State     float64
Year                                     object
dtype: object

### Change Data types

In [9]:
df["TeacherCount_School"] = df["TeacherCount_School"].astype(int)
df["TeacherCount_State"] = df["TeacherCount_State"].astype(int)
df["TeacherAvgYearsExp_School"] = df["TeacherAvgYearsExp_School"].astype(float)
df["TeacherAvgYearsExp_State"] = df["TeacherAvgYearsExp_State"].astype(float)
df["TeacherAvgYearsExpInDistrict_School"] = df["TeacherAvgYearsExpInDistrict_School"].astype(float)
df["TeacherAvgYearsExpInDistrict_State"] = df["TeacherAvgYearsExpInDistrict_State"].astype(float)
df["TeacherInDistrict4YearsOrMore_School"] = df["TeacherInDistrict4YearsOrMore_School"].astype(float)
df["TeacherInDistrict4YearsOrMore_State"] = df["TeacherInDistrict4YearsOrMore_State"].astype(float)

### Check the changed data types

In [10]:
df.dtypes

CountyCode                               object
CountyName                               object
DistrictCode                             object
DistrictName                             object
SchoolCode                               object
SchoolName                               object
TeacherCount_School                       int64
TeacherCount_State                        int64
TeacherAvgYearsExp_School               float64
TeacherAvgYearsExp_State                float64
TeacherAvgYearsExpInDistrict_School     float64
TeacherAvgYearsExpInDistrict_State      float64
TeacherInDistrict4YearsOrMore_School    float64
TeacherInDistrict4YearsOrMore_State     float64
Year                                     object
dtype: object

### Get a look at final data

In [11]:
df.head()

,CountyCode,CountyName,DistrictCode,DistrictName,SchoolCode,SchoolName,TeacherCount_School,TeacherCount_State,TeacherAvgYearsExp_School,TeacherAvgYearsExp_State,TeacherAvgYearsExpInDistrict_School,TeacherAvgYearsExpInDistrict_State,TeacherInDistrict4YearsOrMore_School,TeacherInDistrict4YearsOrMore_State,Year
0,01,ATLANTIC,0010,ABSECON CITY,050,EMMA C ATTALES,29,117464,13.6,12.0,12.9,10.7,92.9,75.5,2017-18
1,01,ATLANTIC,0010,ABSECON CITY,060,H ASHTON MARSH,35,117464,16.1,12.0,15.6,10.7,94.1,75.5,2017-18
2,01,ATLANTIC,0110,ATLANTIC CITY,010,ATLANTIC CITY HIGH SCHOOL,152,117464,14.5,12.0,14.4,10.7,92.1,75.5,2017-18
3,01,ATLANTIC,0110,ATLANTIC CITY,030,SOVEREIGN AVENUE SCHOOL,70,117464,14.6,12.0,14.5,10.7,90.0,75.5,2017-18
4,01,ATLANTIC,0110,ATLANTIC CITY,050,CHELSEA HEIGHTS SCHOOL,34,117464,15.1,12.0,15.1,10.7,88.2,75.5,2017-18

In [12]:
#df1.to_csv(df1.csv)
df.to_csv('TeachersExperienceCertification.csv', encoding='utf-8', index=False)

In [ ]:
#x= df1.to_excel('output1.xlsx')  # doctest: +SKIP